@echo off

"python" "utest1.py"
call :CheckError %errorlevel% "utest1"

pause
exit /b


:: ========================================================
:: 【错误检查函数】
:: %1 = 传入的错误码 (即主程序传进来的 %errorlevel%)
:: %2 = 程序名称
:: ========================================================
:CheckError
:: 判断传进来的第一个参数是否不等于 0
if %1 neq 0 (
    echo.
    echo -------------------------------------------
    echo [错误] %~2 执行失败，错误码为 %1。
    echo 脚本即将退出。
    echo -------------------------------------------
    pause
    :: 注意：这里直接用 exit 会强行关闭整个 CMD 窗口
    exit
)
:: 如果没有错，直接返回主程序继续执行下一行
exit /b 0
